/**************************************************************
2602번
jongtae0509
C
정확한 풀이코드 길이:478 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>
 
int main()
{
    int a[4][4], i, j;
    for(i=0;i<4;i++)
        for(j=0;j<4; j++)
            a[i][j] =0;
    for(i=0;i<3;i++)
        for(j=0;j<3; j++)
            scanf("%d", &a[i][j]);
    for(i=0;i<3;i++)
        for(j=0;j<3; j++)
            a[i][3]+=a[i][j];
    for(i=0;i<4;i++)
        for(j=0;j<3; j++)
            a[3][i]+=a[j][i];
    for(i=0;i<4;i++,printf("\n"))
        for(j=0;j<4;j++)
            printf("%d ",a[i][j]);
}
