/**************************************************************
2624번
jongtae0509
C
정확한 풀이코드 길이:339 byte(s)
수행 시간:14 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>

int main(){
	int m,n,i,j,sum=0;
	scanf("%d",&n);
	for (i=1;i<=n;i++)
    {        
        for (j=2;j<i;j++)
        {
            if (i%j==0)
            {     
                break;
            }
        }
        if (j==i)
        {
            sum+=j;
        }
    }
    printf("%d",sum);
}


