/**************************************************************
1511번
jongtae0509
C
정확한 풀이코드 길이:401 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>

int main(){
	int n[101][101]={},N,i,j,a=1,sum=0;
	scanf("%d",&N);
	for(i=0;i<N;i++){
		for(j=0;j<N;j++){
			n[i][j]=a;
			a++;
		}
	}
	for(i=0;i<N;i++){
		sum+=n[i][0];
	}
	for(i=0;i<N;i++){
		sum+=n[0][i];
	}
	for(i=0;i<N;i++){
		sum+=n[N-1][i];
	}
	for(i=0;i<N;i++){
		sum+=n[i][N-1];
	}
	sum-=n[0][0]+n[N-1][0]+n[0][N-1]+n[N-1][N-1];
	printf("%d",sum);
}
