/**************************************************************
1677번
jongtae0509
C
정확한 풀이코드 길이:363 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>
int main(){
	int n,m,i,j;
	scanf("%d %d",&n,&m);
	for(i=0;i<m;i++){
		for(j=0;j<n;j++){
			if(i==0&&j==0||i==0&&j==n-1||i==m-1&&j==n-1||i==m-1&&j==0){
				printf("+");
			}
			else if(j==0||j==n-1){
				printf("|");
			}
			else if(i==0||i==m-1){
				printf("-");
			}
			else{
				printf(" ");
			}
		}
		printf("\n");
	}
}
