/**************************************************************
1704번
jongtae0509
C
정확한 풀이코드 길이:345 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>
int main()
{
	int a,b,c,d,e;
	scanf("%2d%d %1d%d",&a,&b,&c,&e);
	if(c==1||c==2)
    {
    	d= a+1900;
    	if(c==1)
    	printf("%d M",2012-d+1);
    	else
    	printf("%d F",2012-d+1);
    }
    else
    {
		d=2000+a;
		if(c==3)
    	printf("%d M",2012-d+1);
    	else
    	printf("%d F",2012-d+1);
	}
}

