/**************************************************************
4056번
jongtae0509
C
정확한 풀이코드 길이:335 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>
#include<math.h>
int main(){
	double x;
	int n;
	scanf("%d",&n);
	if(n<=500){
		x=n*0.7;
	}
	else if(n<=1500){
		x=350+((n-500)*0.4);
	}
	else if(n<=4500){
		x=750+((n-1500)*0.15);
	}
	else if(n<=10000){
		x=1200+((n-4500)*0.05);
	}
	else{
		x=1475+((n-10000)*0.02);
	}
	printf("%g",floor(x));
}
