/**************************************************************
4596번
jongtae0509
C
정확한 풀이코드 길이:385 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include<stdio.h>

int main(){
	int a[10][10]={0},i,j,i1,j1,max=0;
	for(i=1;i<=9;i++){
		for(j=1;j<=9;j++){
			scanf("%d",&a[i][j]);
		}
	}
	for(i=1;i<=9;i++){
		for(j=1;j<=9;j++){
			if(a[i][j]>max){
				max=a[i][j];
			}
		}
	}
	for(i=1;i<=9;i++){
		for(j=1;j<=9;j++){
			if(a[i][j]==max){
				i1=i;
				j1=j;
			}
		}
	}
	printf("%d\n%d %d",max,i1,j1);
	
}
