/**************************************************************
4726번
jongtae0509
C++
정확한 풀이코드 길이:333 byte(s)
수행 시간:10 ms
메모리 :1508 kb
****************************************************************/


#include <cstdio>
int n, k,m[100010]={},r=0;
int main(){
    scanf("%d %d", &n, &k);
    for(int i = 0; i < n; i++){
        scanf("%d", &m[i]);
        if(i > 0) m[i] += m[i - 1];
        if(i >= k - 1 && r < m[i] - m[i - k]) r = m[i] - m[i - k];
    }
    if(n == k) return printf("%d", m[n - 1]);
    printf("%d", r);
}
